=========
Numbers
=========

55

---

(source_file
  (expression_statement
    (literal (number))))

========
Strings
========

"hello world"

---

(source_file
  (expression_statement
    (literal (string))))

============
Object literals
============

{ a: 1, b: 'test' }

---

(source_file
  statement: (expression_statement
    expression: (object
      member: (object_member key: (identifier) value: (literal (number)))
      member: (object_member key: (identifier) value: (literal (string))))))

===========================
Object literal with trailing comma
===========================

{ a: 1, b: 'test', }

---

(source_file
  statement: (expression_statement
    expression: (object
      member: (object_member key: (identifier) value: (literal (number)))
      member: (object_member key: (identifier) value: (literal (string))))))

===========================
Symbol literals
===========================

:foo_bar_baz

---

(source_file
  (expression_statement
    (literal (symbol))))
